<?php return [
    // ----------------------------------------------------------------------
    // Master Module Language Lines - Japanese
    // ----------------------------------------------------------------------
    'base'                             => [
        'section'                      => 'マスター',
        'tabs'                         => [
            'sheet'                    => 'PJシート',
            'setting'                  => 'マスター設定',
            'basic'                    => '基本データ',
            'expense'                  => '支出の部',
            'finance'                  => '融資・入出金',
            'section'                  => '事業精算',
        ]
    ]
    // ----------------------------------------------------------------------
];
