<?php return [
    // ----------------------------------------------------------------------
    // Master Module Language Lines - Japanese
    // ----------------------------------------------------------------------
    'base'                             => [
        'section'                      => 'マスター',
        'tabs'                         => [
            'sale-activity'                    => '販売活動',
            'sale-contract'                    => '販売契約',
            'spending-section'                 => '支出の部',
            'trading-ledger'                   => '取引台帳',
        ]
    ]
    // ----------------------------------------------------------------------
];
