<?php

// --------------------------------------------------------------------------
// This config file contains common constants for the whole project
// For example success / error message for CRUD
// --------------------------------------------------------------------------

// --------------------------------------------------------------------------
return [
    // ----------------------------------------------------------------------

    // ----------------------------------------------------------------------
    // Notification messages
    // ----------------------------------------------------------------------
    'SUCCESS_CREATE_MESSAGE'     => '正常に保存されました',
    'FAILED_CREATE_MESSAGE'      => '入力した内容を保存できませんでした。',
    'SUCCESS_UPDATE_MESSAGE'     => '編集した内容を保存しました。',
    'FAILED_UPDATE_MESSAGE'      => '編集した内容を保存できませんでした。',
    'SUCCESS_DELETE_MESSAGE'     => '対象のデータを削除しました。',
    'FAILED_DELETE_MESSAGE'      => '対象のデータを削除できませんでした。',
    'FAILED_DELETE_SELF_MESSAGE' => '現在ログインされている方のデータを削除できませんでした。',
    // ----------------------------------------------------------------------


    // ----------------------------------------------------------------------
    // Company type references
    // ----------------------------------------------------------------------
    'COMPANY_TYPES' => [
        'group'      => 'kind_in_house',
        'agent'      => 'kind_real_estate_agent',
        'contractor' => 'kind_contractor',
        'builder'    => 'kind_house_maker',
        'profession' => 'kind_profession',
        'advisor'    => 'kind_advisory_accounting',
        'bank'       => 'kind_bank',
        'other'      => 'kind_other'
    ],
    // ----------------------------------------------------------------------

    // ----------------------------------------------------------------------
    // Company tooltips at edit and create company form
    // ----------------------------------------------------------------------
    'COMPANY_TYPE_TOOLTIPS' => [
        'group' => '福互のグループ会社。この値を変更する場合は開発者にお知らせ下さい。',
        'agent' => '不動産業者はこのチェックをオンにして不動産業者情報と宅建士を登録して下さい。'
    ],
    // ----------------------------------------------------------------------


    // ----------------------------------------------------------------------
    // QNA question type
    // ----------------------------------------------------------------------
    'QA_INPUT_TYPES' => [
        1 => 'ラジオボタン',
        2 => 'チェックボックス',
        3 => 'テキストボックス',
    ],
    // ----------------------------------------------------------------------


    // ----------------------------------------------------------------------
    // Project sheet group identifier
    // ----------------------------------------------------------------------
    'PROJECT_SHEET_GROUPS' => [
        1 => 'demolition', 
        2 => 'plumbing', 
        3 => 'embankment', 
        4 => 'retaining-wall', 
        5 => 'road', 
        6 => 'gutter', 
        7 => 'complete', 
        8 => 'complete-remote', 
        9 => 'complete-cultural', 
        10 => 'application-fee', 
        11 => 'commission'
    ],
    // ----------------------------------------------------------------------

    // ----------------------------------------------------------------------
    // Japanese syllabary Index, start from 1
    // ----------------------------------------------------------------------
    'KANA_INDEX' => [
        1 => "ア", "イ", "ウ", "エ", "オ", "カ", "キ", "ク", "ケ", "コ", "サ", "シ", "ス", "セ", "ソ", "タ", "チ", "ツ", "テ", "ト", "ナ", "ニ", "ヌ", "ネ", "ノ", "ハ", "ヒ", "フ", "ヘ", "ホ", "マ", "ミ", "ム", "メ", "モ", "ヤ", "ユ", "ヨ", "ラ", "リ", "ル", "レ", "ロ", "ワ", "ヲ", "ン"
    ],
    // ----------------------------------------------------------------------

    // ----------------------------------------------------------------------
    // Percentage Japanese taxes
    // ----------------------------------------------------------------------
    'JAPANESE_TAX' => 10,
    // ----------------------------------------------------------------------

    // ----------------------------------------------------------------------
    // Japanese contract periods
    // https://bit.ly/30Q2sQB
    // ----------------------------------------------------------------------
    'CONTRACT_PERIODS' => array(
        1 => array(
            'label'     => '8期売上(～18.7末)',
            'period'    => array(
                'end'   => '2018/07/31',        // July 31, 2018
            )
        ),
        2  => array(
            'label'     => '9期売上(～19.7末)',
            'period'    => array(
                'start' => '2018/08/01',        // August 1, 2018
                'end'   => '2019/07/31',        // July 31, 2019
            )
        ),
        3 => array(
            'label'     => '10期売上(～20.7末)',
            'period'    => array(
                'start' => '2019/08/01',        // August 1, 2019
                'end'   => '2020/07/31',        // July 31, 2020
            )
        ),
        4 => array(
            'label'     => '10期売上(20.8～)',
            'period'    => array(
                'start' => '2020/08/01'         // August 1, 2020
            )
        )
    )
    // ----------------------------------------------------------------------
];
